Revit 2024 API
BuiltInFailures.StructuralCustomConnectionFailures.SimpleConnectionTooFarRefs Property
 Simple Structural Connection Handler cannot connect too far elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SimpleConnectionTooFarRefs { get; }
Visual Basic
Public Shared ReadOnly Property SimpleConnectionTooFarRefs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SimpleConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace